---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.MarginType
source: html/82d48d94-0d91-9c48-efc7-f7d58c3da411.htm
---
# Autodesk.Revit.DB.PrintParameters.MarginType Property

The print margin type.

## Syntax (C#)
```csharp
public MarginType MarginType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - Thrown when the input argument is out of range.
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown if the PaperPlacement is not Margins type.